In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [6]:
ser1=Series([2,3,4], index=['a', 'b', 'c'])
ser1

a    2
b    3
c    4
dtype: int64

Dframe1=DataFrame(np.arange(4).reshape((2,2)), columns=list('AB'), index=['NYC', 'LA'])

In [7]:
ser2=Series([3,4,5,6], index=['a', 'b', 'c', 'd'])

In [8]:
ser1+ser2

a    5.0
b    7.0
c    9.0
d    NaN
dtype: float64

In [9]:
dframe1=DataFrame(np.arange(4).reshape((2,2)), columns=list('AB'), index=['NYC', 'LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [12]:
dframe2=DataFrame(np.arange(9).reshape((3,3)), columns=list('ADC'), index=['NYC', 'SF','LA'])

In [13]:
dframe1+ dframe2

      A   D   C
NYC   0   2   4
SF    6   8  10
LA   12  14  16

In [14]:
dframe1

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [17]:
dframe1.add(dframe2,fill_value=0)

      A   D   C
NYC   0   2   4
SF    6   8  10
LA   12  14  16